auxetic-brama706/esp32-claude-workbench/templates/esp-idf-basic/sdkconfig.defaults
# Default sdkconfig settings for this template
# Override in sdkconfig or menuconfig as needed

# Target: ESP32 (change for other chips)
CONFIG_IDF_TARGET="esp32"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Log level: Info (reduce to Warning for production)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS tick rate: 1000 Hz for 1ms resolution
CONFIG_FREERTOS_HZ=1000

# Task watchdog timeout: 10 seconds
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Stack overflow detection
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# Compiler stack checking
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
CONFIG_COMPILER_STACK_CHECK=y
